## Pandas

#### Working with Pandas series
a) Creating the Series:
Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index. Labels need not be unique but must be a hashable type. The object supports both integer and label-based indexing and provides a host of methods for performing operations involving the index.

In [1]:
import numpy as np
import pandas as pd

In [2]:
#Series Through List
lst=[1,2,3,4,5]
s= pd.Series(lst)
print(s)
print(type(s))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
#Series through numpy array
arr=np.array([1,2,3,4,5])
print(arr)
s=pd.Series(arr)
print(type(s))
print(s)

[1 2 3 4 5]
<class 'pandas.core.series.Series'>
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
#Giving index from our own end
s=pd.Series(index=['Vibha','Vidant','Shreeyan'],data=[1,2,3])
print(type(s))
print(s)

<class 'pandas.core.series.Series'>
Vibha       1
Vidant      2
Shreeyan    3
dtype: int64

In [5]:
#Series Through Dictionary value
d={'Vibha':1,'Vidant':2,'Shreeyan':3}
s=pd.Series(d)
print(d)
print(s)

{'Vibha': 1, 'Vidant': 2, 'Shreeyan': 3}
Vibha       1
Vidant      2
Shreeyan    3
dtype: int64

#### Using repeat function along with creating a Series
Pandas Series.repeat() function repeat elements of series. It returns a new series where each element of the series is repeated consequently given number of times

In [6]:
s= pd.Series(5).repeat(4)
print(s)

0    5
0    5
0    5
0    5
dtype: int64

In [7]:
# We can use reset function to make the index occurate
pd.Series(5).repeat(4).reset_index(drop=True)

0    5
1    5
2    5
3    5
dtype: int64

In [8]:
#Following code repeats 10 5 times and 20 2 times
s=pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)
print(s)

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [9]:
#Accessing Elements
print(s[4])
print(s[6])

10
20

In [10]:
s[3:-1]

3    10
4    10
5    20
dtype: int64

#### b) Aggregate funtion on pandas series
Pandas aggreagate() function aggregate using one or more operation over the specifies axis in the given series object.

In [11]:
s=pd.Series([1,2,3,4,5])
s.agg([min,max,sum])

min     1
max     5
sum    15
dtype: int64

#### Series absolute function
Pandas.abs() method is used to find the absolute numeric value of each element in series

In [12]:
s=pd.Series([1,2,-3,-4,5,-6,7])
s.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

##### d) Appending Series
Pandas Series.append() function is used to concatenate two or more series object.

Syntax: Series.append(to_append, ignore_index=False, verify_integrity=False)

Parameter : to_append : Series or list/tuple of Series ignore_index : If True, do not use the index labels. verify_integrity : If True, raise Exception on creating index with duplicates

In [13]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([10,20,30,40])
s3=s2.append(s1)
print(s3)

0    10
1    20
2    30
3    40
0     1
1     2
2     3
3     4
4     5
dtype: int64

/tmp/ipykernel_5022/3626257549.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s3=s2.append(s1)

In [14]:
s3.reset_index(drop=True)

0    10
1    20
2    30
3    40
4     1
5     2
6     3
7     4
8     5
dtype: int64

#### e) Astype function
Pandas astype() is the one of the most important methods. It is used to change data type of a series. When data frame is made from a csv file, the columns are imported and data type is set automatically which many times is not what it actually should have.

In [15]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [16]:
type(s1[0])

numpy.int64

In [17]:
s2=s1.astype(float)

In [18]:
type(s2[0])

numpy.float64

### f) Between function:
Pandas Between function is used on series to check which values lie between first and second argument

In [19]:
s1=pd.Series([1,2,3,10,6,20,30,7,44,8])
s1

0     1
1     2
2     3
3    10
4     6
5    20
6    30
7     7
8    44
9     8
dtype: int64

In [20]:
s1.between(10,50)

0    False
1    False
2    False
3     True
4    False
5     True
6     True
7    False
8     True
9    False
dtype: bool

#### g) All strings functions can be used to extract or modify texts in a series
1. Upper and Lower function
2. Len function
3. Strip functionun
4. Split Function
5. Contains Function
6. Replace Function
7. Count Function
8. Start with and Endswith function
9. Find Function

In [21]:
s=pd.Series(['C','C++','Java   ','   Sql','    Python','Go','R','Html','Javascript','Css'])
s

0             C
1           C++
2       Java
3           Sql
4        Python
5            Go
6             R
7          Html
8    Javascript
9           Css
dtype: object

In [22]:
print(s.str.upper())
print('-'*20)
print(s.str.lower())

0             C
1           C++
2       JAVA
3           SQL
4        PYTHON
5            GO
6             R
7          HTML
8    JAVASCRIPT
9           CSS
dtype: object
--------------------
0             c
1           c++
2       java
3           sql
4        python
5            go
6             r
7          html
8    javascript
9           css
dtype: object

In [23]:
for i in s:
    print(len(i))

1
3
7
6
10
2
1
4
10
3

In [24]:
for i in s:
    print(i.strip(),len(i))

C 1
C++ 3
Java 7
Sql 6
Python 10
Go 2
R 1
Html 4
Javascript 10
Css 3

In [25]:
s=pd.Series(['Computer Programming','Computer Network','Operating System', 'Data Science'])
s1=s.str.split()
print(s1)

0    [Computer, Programming]
1        [Computer, Network]
2        [Operating, System]
3            [Data, Science]
dtype: object

In [26]:
#Contains function
print(s)
s.str.contains('Computer')

0    Computer Programming
1        Computer Network
2        Operating System
3            Data Science
dtype: object

0     True
1     True
2    False
3    False
dtype: bool

In [27]:
#Replace function
s.str.replace('Computer','Introduction to')

0    Introduction to Programming
1        Introduction to Network
2               Operating System
3                   Data Science
dtype: object

In [28]:
#count function
s.str.count('a')

0    1
1    0
2    1
3    2
dtype: int64

In [29]:
#starts with and endswith function
print(s)
s.str.startswith('D')
s.str.endswith('k')

0    Computer Programming
1        Computer Network
2        Operating System
3            Data Science
dtype: object

0    False
1     True
2    False
3    False
dtype: bool

In [30]:
#Find Function
s.str.find('Network')

0   -1
1    9
2   -1
3   -1
dtype: int64

### g) Converting a series to List
pandas tolist() is used to convert a series to list.

In [31]:
l=s.to_list()
print(type(l))
print(l)

<class 'list'>
['Computer Programming', 'Computer Network', 'Operating System', 'Data Science']

### <font color=blue> 2. Implementation of Pandas Data frame</font>
Pandas Data frame is 2D size mutable, potentially hetrogeneous tabular data structure with labelled axis. A Data framme is 2D data structure. i.e data is aligned in a tabular in rows and colums. Pandas DataFrame consists of three principal components, the data, rows, and columns

In [32]:
# a. Creating data frame using List
lst=['Vibha','Vidant','Shreeyan','Druti']
pd.DataFrame(lst)

          0
0     Vibha
1    Vidant
2  Shreeyan
3     Druti

In [33]:
lst=[['tom',10],['Jerry',12],['spike',14]]
pd.DataFrame(lst)

       0   1
0    tom  10
1  Jerry  12
2  spike  14

### Creating DataFrame from dict of ndarray/lists:
To create DataFrame from dict of narray/list, all the narray must be of same length. If index is passed then the length index should be equal to the length of arrays. If no index is passed, then by default, index will be range(n) where n is the array length.

In [34]:
data={'name':['Vibha','Vidant','Shreeyan','Druti'],'age':[7,2,0.5,1]}
pd.DataFrame(data)

       name  age
0     Vibha  7.0
1    Vidant  2.0
2  Shreeyan  0.5
3     Druti  1.0

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. We can perform basic operations on rows/columns like selecting, deleting, adding, and renaming.
Column Selection: In Order to select a column in Pandas DataFrame, we can either access the columns by calling them by their columns name.

In [35]:
data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df=pd.DataFrame(data)
df[['Name','Address']]

     Name    Address
0     Jai      Delhi
1  Princi     Kanpur
2  Gaurav  Allahabad
3    Anuj    Kannauj

### b) Slicing in DataFrames Using iloc and loc
Pandas comprises many methods for its proper functioning. loc() and iloc() are one of those methods. These are used in slicing data from the Pandas DataFrame. They help in the convenient selection of data from the DataFrame in Python. They are used in filtering the data according to some conditions.

In [36]:
data={'one':pd.Series([1,2,3,4]),
    'two':pd.Series([10,20,30,40]),
      'three':pd.Series([100,200,300,400]),
      'four':pd.Series([1000,2000,3000,4000])
     
     }
df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

#### Basic loc Operations
Python loc() function The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select. This method includes the last element of the range passed in it, unlike iloc(). loc() can accept the boolean data unlike iloc(). Many operations can be performed using the loc() method like

In [37]:
print(df.loc[1:2,'two':'three'])

   two  three
1   20    200
2   30    300

#### Basic iloc Operations
The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it unlike loc(). iloc() does not accept the boolean data unlike loc().

In [38]:
df.iloc[1: 4,2: -1]

   three
1    200
2    300
3    400

In [39]:
df.iloc[:,3:4]

   four
0  1000
1  2000
2  3000
3  4000

In [40]:
#Selecting specific row
df.iloc[[0,2],[1,0]]

   two  one
0   10    1
2   30    3

#### c) Slicing Using Conditions
Using Conditions works with loc basically

In [41]:
df.loc[df['two']>20, ['three','four']]

#So we could extract only those data for which the value is more 
#than 20
#For the columns we have used comma(,) to extract specifc columns 
#which is 'three' and 'four'

   three  four
2    300  3000
3    400  4000

#### c) Column addition in Data frame

In [42]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

#### We can add a column in many ways. Let us discuss three ways how we can add column here

* Using List
* Using Pandas Series
* Using an existing Column(we can modify that column in the way we want and that modified part can also be displayed)

In [43]:
#Using List
l=[11,22,33,44]
df['five']=l
df

   one  two  three  four  five
0    1   10    100  1000    11
1    2   20    200  2000    22
2    3   30    300  3000    33
3    4   40    400  4000    44

In [44]:
#Using Pandas Series
s=pd.Series([111,222,333,444])
df['six']=s
df

   one  two  three  four  five  six
0    1   10    100  1000    11  111
1    2   20    200  2000    22  222
2    3   30    300  3000    33  333
3    4   40    400  4000    44  444

In [45]:
# Using an existing column
df['seven']=df['two']*70
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    11  111    700
1    2   20    200  2000    22  222   1400
2    3   30    300  3000    33  333   2100
3    4   40    400  4000    44  444   2800

#### d) Deleting Column in data frame
* Using del
* Using pop

In [46]:
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    11  111    700
1    2   20    200  2000    22  222   1400
2    3   30    300  3000    33  333   2100
3    4   40    400  4000    44  444   2800

In [47]:
#del df[six]
del df['seven']
df

   one  two  three  four  five  six
0    1   10    100  1000    11  111
1    2   20    200  2000    22  222
2    3   30    300  3000    33  333
3    4   40    400  4000    44  444

In [48]:
df.pop('five')
df

   one  two  three  four  six
0    1   10    100  1000  111
1    2   20    200  2000  222
2    3   30    300  3000  333
3    4   40    400  4000  444

#### e) Addition of rows
In a Pandas DataFrame, you can add rows by using the append method. You can also create a new DataFrame with the desired row values and use the append to add the new row to the original dataframe. Here's an example of adding a single row to a dataframe:

In [49]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])


df3 = df1.append(df2).reset_index(drop = True)

df3

/tmp/ipykernel_5022/3894115464.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3 = df1.append(df2).reset_index(drop = True)

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [50]:
df

   one  two  three  four  six
0    1   10    100  1000  111
1    2   20    200  2000  222
2    3   30    300  3000  333
3    4   40    400  4000  444

#### f) Pandas drop function
Python is a great language for doing data analysis, primarily because of the fantastic ecosystem of data-centric Python packages. Pandas is one of those packages and makes importing and analyzing data much easier.

Pandas provide data analysts a way to delete and filter data frame using .drop() method. Rows or columns can be removed using index label or column name using this method.

Syntax: DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors=raise)

Parameters:

labels: String or list of strings referring row or column name. axis: int or string value, 0 index for Rows and 1 columns for Columns. index or columns: Single label or list. index or columns are an alternative to axis and cannot be used together. level: Used to specify level in case data frame is having multiple level index. inplace: Makes changes in original Data Frame if True. errors: Ignores error if any value from the list doesnt exists and drops rest of the values when errors = ignore

Return type: Dataframe with dropped values

In [51]:
#Axis 0 for rows
df.drop([0,1],axis=0,inplace=True)
df

   one  two  three  four  six
2    3   30    300  3000  333
3    4   40    400  4000  444

In [52]:
#Axis 1 for column
df.drop(['one','three'], axis = 1, inplace = True)
df

   two  four  six
2   30  3000  333
3   40  4000  444

#### g) Transposing a DataFrame
The .T attribute in a Pandas DataFrame is used to transpose the dataframe, i.e., to flip the rows and columns. The result of transposing a dataframe is a new dataframe with the original rows as columns and the original columns as rows.

Here's an example to illustrate the use of the .T attribute:

In [53]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [54]:
#Transpose
df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

#### h) A set of more DataFrame Functionalities

In [55]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [56]:
# axes function
#The .axes attribute in a Pandas DataFrame returns a list with the 
#row and column labels of the DataFrame. The first element of the list is 
#the row labels (index), and the second element is the column labels.

df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

##### ndim function
The .ndim attribute in a Pandas DataFrame returns the number of dimensions of the dataframe, which is always 2 for a DataFrame (row-and-column format).

In [57]:
df.ndim

2

#### dtypes
The .dtypes attribute in a Pandas DataFrame returns the data types of the columns in the DataFrame. The result is a Series with the column names as index and the data types of the columns as values.

In [58]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

#### shape function
The .shape attribute in a Pandas DataFrame returns the dimensions (number of rows, number of columns) of the DataFrame as a tuple.

In [59]:
df.shape

(4, 4)

In [60]:
#head(n):  returns the first n rows 

df.head(1)

   one  two  three  four
0    1   10    100  1000

In [61]:
# tail(n): returns the last n rows.
df.tail(2)

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [62]:
# empty(): returns a Boolean value indicating whether the DataFrame is empty or not.
d=pd.DataFrame()
d.empty

True

#### i) Statistical or Mathematical Functions
Sum 
 
 Mean 
 
 Median 
 
 Mode 
 
 Variance 
 
 Min 
 
 Max 
 
 Standard Deviation

In [63]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [64]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

In [65]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [66]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [67]:
df.mode()

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [68]:
df.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

In [69]:
df.std()

one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64

In [70]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [71]:
df.max()

one         4
two        40
three     400
four     4000
dtype: int64

#### j) Describe Function
The describe() method in a Pandas DataFrame returns descriptive statistics of the data in the DataFrame. It provides a quick summary of the central tendency, dispersion, and shape of the distribution of a set of numerical data.

The default behavior of describe() is to compute descriptive statistics for all numerical columns in the DataFrame. If you want to compute descriptive statistics for a specific column, you can pass the name of the column as an argument.

In [72]:
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

#### k) Pipe Functions
1. Pipe Function

The pipe() method in a Pandas DataFrame allows you to apply a function to the DataFrame, similar to the way the apply() method works. The difference is that pipe() allows you to chain multiple operations together by passing the output of one function to the input of the next function.

In [73]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [74]:
def add_(i,j):
    return i + j

df.pipe(add_, 10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

#### 2. Apply Function
The apply() method in a Pandas DataFrame allows you to apply a function to the DataFrame, either to individual elements or to the entire DataFrame. The function can be either a built-in Python function or a user-defined function.

In [75]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [76]:
print(df.apply(np.mean))

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [77]:
df.apply(lambda x: x.max() - x.min())

one         3
two        30
three     300
four     3000
dtype: int64

#### 3. Apply map function
The map() method in a Pandas DataFrame allows you to apply a function to each element of a specific column of the DataFrame. The function can be either a built-in Python function or a user-defined function.

In [78]:
df.applymap(lambda x : x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

applymap and apply are both functions in the pandas library used for applying a function to elements of a pandas DataFrame or Series.

applymap is used to apply a function to every element of a DataFrame. It returns a new DataFrame where each element has been modified by the input function.

apply is used to apply a function along any axis of a DataFrame or Series. It returns either a Series or a DataFrame, depending on the axis along which the function is applied and the return value of the function. Unlike applymap, apply can take into account the context of the data, such as the row or column label.

So, applymap is meant for element-wise operations while apply can be used for both element-wise and row/column-wise operations.

##### l) Reindex Function
The reindex function in Pandas is used to change the row labels and/or column labels of a DataFrame. This function can be used to align data from multiple DataFrames or to update the labels based on new data. The function takes in a list or an array of new labels as its first argument and, optionally, a fill value to replace any missing values. The reindexing can be done along either the row axis (0) or the column axis (1). The reindexed DataFrame is returned.

In [79]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [80]:
#Rows
print(df.reindex([1,0,3,2]))

   one  two  three  four
1    2   20    200  2000
0    1   10    100  1000
3    4   40    400  4000
2    3   30    300  3000

In [81]:
#column
print(df)
print(df.reindex(columns=['one','three','two','four']))

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
   one  three  two  four
0    1    100   10  1000
1    2    200   20  2000
2    3    300   30  3000
3    4    400   40  4000

#### m) Renaming Columns in Pandas DataFrame
The rename function in Pandas is used to change the row labels and/or column labels of a DataFrame. It can be used to update the names of one or multiple rows or columns by passing a dictionary of new names as its argument. The dictionary should have the old names as keys and the new names as values

In [82]:
df.rename(columns = {'one' : 'One','two': 'Two', 'three' : 'Three', 'four' : 'Four'}, 
           inplace = True, index = {0:'a',1:'b',2:'c',4:'d'})
df

   One  Two  Three  Four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
3    4   40    400  4000

#### n) Sorting in Pandas DataFrame
Pandas provides several methods to sort a DataFrame based on one or more columns.

sort_values: This method sorts the DataFrame based on one or more columns. The default sorting order is ascending, but you can change it to descending by passing the ascending argument with a value of False.

In [83]:
data = { 'one'   : pd.Series([11, 51, 31, 41]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 500, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0   11   10    100  1000
1   51   20    200  2000
2   31   30    500  3000
3   41   40    400  4000

In [84]:
df.sort_values(by = 'one')

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

In [85]:
df.sort_values(by = 'one', ascending = False)

   one  two  three  four
1   51   20    200  2000
3   41   40    400  4000
2   31   30    500  3000
0   11   10    100  1000

In [86]:
df.sort_values(by = ['one','two'])

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

#### Sort with Specific Sorting Algorithm:<br>

* quicksort
* mergesort
* heapsort

In [87]:
df.sort_values(by = ['one'], kind = 'heapsort')

   one  two  three  four
0   11   10    100  1000
2   31   30    500  3000
3   41   40    400  4000
1   51   20    200  2000

#### o) Groupby Functions
The groupby function in pandas is used to split a dataframe into groups based on one or more columns. It returns a DataFrameGroupBy object, which is similar to a DataFrame but has some additional methods to perform operations on the grouped data.

In [88]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}

df = pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2015     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [89]:
df.groupby('Team').groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [90]:
# To search for specific Country with specific year

df.groupby(['Team','Year']).get_group(('India',2014))

    Team  Rank  Year  Points
0  India     2  2014     876

In [91]:
# Adding some statistical computation on top of groupby

df.groupby('Team').sum()['Points']

Team
Australia    1706
India        2459
NZ           2332
SA           3218
Name: Points, dtype: int64

In [92]:
groups = df.groupby('Team')
groups['Points'].agg([np.sum, np.mean, np.std,np.max,np.min])

            sum        mean        std  amax  amin
Team
Australia  1706  853.000000  53.740115   891   815
India      2459  819.666667  49.702448   876   782
NZ         2332  777.333333  97.449132   883   691
SA         3218  804.500000  28.769196   834   776

In [93]:
# filter function along with groupby

df.groupby('Team').filter(lambda x : len(x) == 3)

     Team  Rank  Year  Points
0   India     2  2014     876
1   India     3  2015     801
8      NZ     2  2016     758
9      NZ     4  2014     691
10     NZ     1  2015     883
11  India     2  2017     782

In [94]:
# filter function along with groupby
df.groupby('Team').filter(lambda x : len(x) == 4)

  Team  Rank  Year  Points
4   SA     3  2014     776
5   SA     4  2015     784
6   SA     1  2016     834
7   SA     1  2017     824

### 3. Working with csv files and basic data Analysis using Pandas

In [95]:
# A) Reading CSV
df= pd.read_csv('Football.csv')
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [96]:
# b) info function
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 660 entries, 0 to 659
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  660 non-null    object
 1   League                   660 non-null    object
 2   Club                     660 non-null    object
 3   Player Names             660 non-null    object
 4   Matches_Played           660 non-null    int64
 5   Substitution             660 non-null    int64
 6   Mins                     660 non-null    int64
 7   Goals                    660 non-null    int64
 8   xG                       660 non-null    float64
 9   xG Per Avg Match         660 non-null    float64
 10  Shots                    660 non-null    int64
 11  OnTarget                 660 non-null    int64
 12  Shots Per Avg Match      660 non-null    float64
 13  On Target Per Avg Match  660 non-null    float64
 14  Year                     660 non-null    int64
dtypes: float64(4), int64(7), object(4)
memory usage: 77.5+ KB

### isnull() function to check if there are nan values present

In [97]:
df.isnull()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
656,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
657,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
658,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
659,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [98]:
#If we use the sum function along with it then we can get how many null values are present in each columns
df.isnull().sum()

Country                    0
League                     0
Club                       0
Player Names               0
Matches_Played             0
Substitution               0
Mins                       0
Goals                      0
xG                         0
xG Per Avg Match           0
Shots                      0
OnTarget                   0
Shots Per Avg Match        0
On Target Per Avg Match    0
Year                       0
dtype: int64

### d) Quantile function to get the specific percentile value

In [99]:
df.describe(percentiles=[.80])

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
80%,32.000000,6.000000,2915.800000,15.000000,14.076000,0.610000,90.000000,39.000000,3.600000,1.630000,2020.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000

In [100]:
# Let us use the quantile function to get the exact value now
df['Mins'].quantile(.8)

2915.8

In [101]:
# To get the 99 percentile value we can write
df['Mins'].quantile(.99)

3520.0199999999995

### e) Copy function

In [102]:
de=df.copy()
de.head(4)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016

In [103]:
de['Year+100']=de['Year']+100
de.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year,Year+100
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016,2116
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016,2116
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016,2116
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016,2116
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016,2116

* So we can see a new column has been added here but our old data is secured

### f) Value Counts function
Pandas Series.value_counts() function return a Series containing counts of unique values. The resulting object will be in descending order so that the first element is the most frequently-occurring element. Excludes NA values by default.

Syntax: Series.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)

In [104]:
df['Player Names'].value_counts()

Andrea Belotti     5
Lionel Messi       5
Luis Suarez        5
Andrej Kramaric    5
Ciro Immobile      5
                  ..
Francois Kamano    1
Lebo Mothiba       1
Gaetan Laborde     1
Falcao             1
Cody Gakpo         1
Name: Player Names, Length: 444, dtype: int64

#### g) Unique and Nunique Function
While analyzing the data, many times the user wants to see the unique values in a particular column, which can be done using Pandas unique() function.

In [105]:
ar=df['Player Names'].unique()
#print(ar)
print(len(ar))

444

In [106]:
df['Player Names'].nunique()

444